source/geh_wholesale/tests/scenario_tests/data_products/wholesale_results/given_minimal_wholesale_results_scenario/then/wholesale_results.monthly_amounts_per_charge_v1.csv

calculation_id;calculation_type;calculation_version;result_id;grid_area_code;energy_supplier_id;charge_code;charge_type;charge_owner_id;quantity_unit;is_tax;currency;time;amount
0b15a420-9fc8-409a-a169-111111111111;wholesale_fixing;1;11111111-9fc8-409a-a169-fbd49479d718;804;8100000000108;fee-1;fee;5790001330552;pcs;false;DKK;2023-01-31T23:00:00Z;1.234567
0b15a420-9fc8-409a-a169-111111111111;wholesale_fixing;1;11111112-9fc8-409a-a169-fbd49479d718;805;8100000000109;41000;tariff;5790001330553;kWh;false;DKK;2023-01-31T23:00:00Z;2